In [28]:
import mysql.connector

In [29]:
mydb=mysql.connector.connect(
  host="localhost",
  user="root",
  password="Sudha@123")

In [30]:
print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000015BAD4927F0>

In [31]:
mydb=mysql.connector.connect(
  host="localhost",
  user="root",
  password="Sudha@123",
  database="edureka")

In [32]:
mycursor=mydb.cursor()

mycursor.execute("SHOW TABLES")

for x in mycursor:
    print(x)

('emp',)
('emp_data',)
('emp_data2',)
('student',)

In [33]:
mycursor.execute("SELECT * FROM emp_data2")

myresult=mycursor.fetchall()

for x in myresult:
    print(x)

(10001, 'Ramanna ji', datetime.date(1946, 1, 22), 'Dhobhi ghat')
(10002, 'Ramannajum ji', datetime.date(1966, 11, 21), 'Dhobhi ghat')
(10003, 'Ramannakutti ji', datetime.date(1996, 10, 7), 'Dhobhi ghat')
(10004, 'Ramanna Pratap ji', datetime.date(1986, 12, 2), 'Dhobhi ghat')
(10005, 'Ratan', datetime.date(1946, 1, 22), 'Mumbai')
(10006, 'Raniji', datetime.date(1966, 11, 21), 'Mumbai')
(10007, 'Ramani ji', datetime.date(1996, 10, 7), 'Delhi')
(10008, 'Raman ji', datetime.date(1986, 12, 2), 'Delhi')

In [35]:
mycursor.execute("SELECT * FROM emp_data2 ORDER BY id DESC")

myresult=mycursor.fetchall()

for x in myresult:
    print(x)

(10008, 'Raman ji', datetime.date(1986, 12, 2), 'Delhi')
(10007, 'Ramani ji', datetime.date(1996, 10, 7), 'Delhi')
(10006, 'Raniji', datetime.date(1966, 11, 21), 'Mumbai')
(10005, 'Ratan', datetime.date(1946, 1, 22), 'Mumbai')
(10004, 'Ramanna Pratap ji', datetime.date(1986, 12, 2), 'Dhobhi ghat')
(10003, 'Ramannakutti ji', datetime.date(1996, 10, 7), 'Dhobhi ghat')
(10002, 'Ramannajum ji', datetime.date(1966, 11, 21), 'Dhobhi ghat')
(10001, 'Ramanna ji', datetime.date(1946, 1, 22), 'Dhobhi ghat')